// კომპონენტი არის React - ში ფუნქცია ან კლასი, რომელიც აბრუნებს JSX - ს.
// JSX აღწერს თუ როგორ უნდა გამოჩნდეს ელემენტები ბრაუზერში.

// კომპონენტების გამოყენება კარგი პრაქტიკაა რადგან:
// 1. კოდის ხელახლა გამოყენება შეგვიძლია (reusable code)
// 2. კოდი უფრო ორგანიზებული ხდება
// 3. მარტივია დიდი აპლიკაციის დაყოფა პატარა ნაწილებად
// 4. თითოეულ კომპონენტს შეუძლია საკუთარი ლოგიკის ქონა

import Box from "./Box";

function App() {
  return (
    <div>

      {/* პირველი Box კომპონენტი */}
      <Box />

      {/* მეორე Box კომპონენტი */}
      <Box />

    </div>
  );
}

export default App;
